app/controllers/users_controller.rb

  def login
    @user = User.find_by(name: params[:name], password: params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'niina' AND `users`.`password` = 'magi0810' LIMIT 1