app/controllers/users_controller.rb

  def login
    @user = User.find_by(username: params[:username], password: params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` IS NULL AND `users`.`password` IS NULL LIMIT 1